import { Box, Typography } from "@mui/material";
import { titleStyle, contentStyle } from "../styles";

const Contents = () => {
  return (
    <>
      <Box sx={{ display: "flex", justifyContent: "center" }}>
        <Box sx={contentStyle}>
          <Typography variant="body1" component="p" sx={titleStyle}>
            به وین گیم خوش آمدید! ما یک فروشگاه اینترنتی متخصص در زمینه بازی های
            ویدیویی، کنسول های بازی و تجهیزات مربوط به گیمینگ هستیم. در وین گیم،
            تمرکز ما بر روی ارائه بهترین و جدیدترین محصولات گیمینگ از برندهای
            معتبر در جهان است.
          </Typography>
          <Typography
            variant="body2"
            sx={{ color: "#777", fontSize: "16px", lineHeight: 2 }}
          >
            ما با تیمی از متخصصین فروش و پشتیبانی مشتاق که با تمام قلب به گیمینگ
            علاقه‌مندند، همراهی می‌کنیم. ما به شما تضمین می‌کنیم که از تجربه
            خرید آسان و رضایتمندی در وین گیم لذت خواهید برد. هرگز نگرانی در مورد
            کیفیت محصولاتمان نداشته باشید، زیرا ما فقط از تامین کنندگانی با
            سابقه و معتبر استفاده می‌کنیم.
          </Typography>
          <Typography variant="body1" component="p" sx={titleStyle}>
            وظیفه ی ما
          </Typography>
          <Typography variant="body2" sx={{ color: "#777", fontSize: "16px" }}>
            به طور کلی، در وین گیم به فروش کنسول‌های بازی، بازی‌های ویدیویی،
            تجهیزات گیمینگ و لوازم جانبی مربوط به این دسته از محصولات
            می‌پردازیم.
          </Typography>
          <Typography variant="body1" component="p" sx={titleStyle}>
            خدمات و محصولات
          </Typography>
          <Typography variant="body2" sx={{ color: "#777", fontSize: "16px",lineHeight:2 }}>
            در بخش کنسول‌های بازی، محصولاتی از برندهای مختلفی مانند سونی،
            مایکروسافت و نینتندو در فروشگاه ما موجود هستند. این کنسول‌ها شامل
            پلی‌استیشن ۵، ایکس باکس سری ایکس و اس، نینتندو سوئیچ و نسخه‌های
            مختلفی از این کنسول‌ها هستند. در بخش بازی‌های ویدیویی، شما می‌توانید
            بازی‌های جدید و محبوبی را از برندهایی مانند EA، Activision، Ubisoft،
            Rockstar و بسیاری دیگر پیدا کنید. این بازی‌ها شامل بازی‌های اکشن،
            ماجراجویی، ورزشی، رانندگی و بسیاری دیگر هستند. در بخش تجهیزات گیمینگ
            و لوازم جانبی، شما می‌توانید انواع مختلفی از لوازم جانبی گیمینگ
            مانند کیبورد، ماوس، هدست، کنترلر، وب کم، میکروفن و بسیاری موارد دیگر
            را پیدا کنید. ما همچنین محصولات جانبی مربوط به کنسول‌های بازی مانند
            کنترلر‌های بیشتر و قاب‌های حمل و نقل را نیز در فروشگاه خود داریم.
          </Typography>
        </Box>
      </Box>
    </>
  );
};

export default Contents;
